ninety-nine-cats/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find(params[:id])
        if @cat && @cat.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "brown"], ["description", "My name is Bob!"], ["updated_at", "2023-03-11 00:54:21.638407"], ["id", 4]]